t21/Walnut_X/Packages/.cache/Keil.Kinetis_K20_DFP.1.3.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>Kinetis_K20_DFP</name>
  <description>Freescale Kinetis K20 Series Device Support and Examples</description>

  <releases>
    <release version="1.3.0" date="2015-06-03">
      Added MK22FA12 and MK26FN2M0xxx18 device support.
      Updated MK21F12, MK22F12, MK26F18 device support and documentation.
    </release>
    <release version="1.2.0" date="2014-07-30">
      Added MK21DX128Axxx5, MK21DX256Axxx5, MK21DN512Axxx5 devices
      Added MK21FX512Axxx12, MK21FN1M0Axxx12 devices
      Added TWR-K24F120M examples
    </release>
    <release version="1.1.0" date="2014-06-24">
      Added MK24FN256xxx12 device
      Updated K22F CMSIS files.
    </release>
   <release version="1.0.2">
      USB Device Driver: Endpoint read fixed
    </release>
    <release version="1.0.1">
      Added GPIO, DMA and USBD drivers for MK20D5 devices.
      New Device: MK24FN1M0xxx12
    </release>
    <release version="1.0.0">
      First Release version of K20 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Freescale</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Freescale</keyword>
    <keyword>K20</keyword>
  </keywords>

  <devices>
    <family Dfamily="K20 Series" Dvendor="Freescale:78">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1"/>
      <book name="Documents\dui0553a_cortex_m4_dgug.pdf"           title="Cortex-M4 Generic User Guide"/>
      <book name="Documents\K20PB.pdf"                             title="K20 Family Product Brief"/>
      <description>
The Kinetis K2x MCU family is pin-peripheral and software-compatible with many of the Kinetis K series MCU families, offering full and high-speed USB 2.0 On-The-Go, in addition to other features like device charge detect capability and USB crystal-less functionality.
Devices start from 32 KB of flash in 5 x 5 mm 32-pin QFN packages extending up to 2 MB in a 144-pin MAPBGA package.
These devices offer various levels of integration, with a rich suite of analog, communication, timing and control peripherals.
Next-generation Kinetis K2x MCUs are further optimized for performance with industry-leading power consumption and offer more streamlined integration for further BOM cost reductions.
The K2x USB MCUs are Energy-Efficient Product Solutions by Freescale.
      </description>

      <!-- ******************************  MK20DN128xxx5  ****************************** -->
      <device Dname="MK20DN128xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device\Include\MK20D5.h"  define="MK20DN128xxx5"/>
        <debug      svd="SVD\MK20D5.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P128_50MHZ.FLM"  start="0x00000000"  size="0x20000"                  default="1"/>
        <book name="Documents\K20P64M50SF0RM.pdf"          title="MK20DN128xxx5 Reference Manual"/>
        <book name="Documents\K20P64M50SF0.pdf"            title="MK20DN128xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK20DN32xxx5  ****************************** -->
      <device Dname="MK20DN32xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device\Include\MK20D5.h"  define="MK20DN32xxx5"/>
        <debug      svd="SVD\MK20D5.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFF000"  size="0x1000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P32_50MHZ.FLM"   start="0x00000000"  size="0x8000"                   default="1"/>
        <book name="Documents\K20P64M50SF0RM.pdf"          title="MK20DN32xxx5 Reference Manual"/>
        <book name="Documents\K20P64M50SF0.pdf"            title="MK20DN32xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK20DN64xxx5  ****************************** -->
      <device Dname="MK20DN64xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device\Include\MK20D5.h"  define="MK20DN64xxx5"/>
        <debug      svd="SVD\MK20D5.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P64_50MHZ.FLM"   start="0x00000000"  size="0x10000"                  default="1"/>
        <book name="Documents\K20P64M50SF0RM.pdf"          title="MK20DN64xxx5 Reference Manual"/>
        <book name="Documents\K20P64M50SF0.pdf"            title="MK20DN64xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK20DX128xxx5  ****************************** -->
      <device Dname="MK20DX128xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device\Include\MK20D5.h"  define="MK20DX128xxx5"/>
        <debug      svd="SVD\MK20D5.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x10000000"  size="0x8000"     startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P128_50MHZ.FLM"  start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash\MK_D32_50MHZ.FLM"   start="0x10000000"  size="0x8000"                   default="1"/>
        <book name="Documents\K20P64M50SF0RM.pdf"          title="MK20DX128xxx5 Reference Manual"/>
        <book name="Documents\K20P64M50SF0.pdf"            title="MK20DX128xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK20DX32xxx5  ****************************** -->
      <device Dname="MK20DX32xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device\Include\MK20D5.h"  define="MK20DX32xxx5"/>
        <debug      svd="SVD\MK20D5.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x10000000"  size="0x8000"     startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFF000"  size="0x1000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P32_50MHZ.FLM"   start="0x00000000"  size="0x8000"                   default="1"/>
        <algorithm  name="Flash\MK_D32_50MHZ.FLM"   start="0x10000000"  size="0x8000"                   default="1"/>
        <book name="Documents\K20P64M50SF0RM.pdf"          title="MK20DX32xxx5 Reference Manual"/>
        <book name="Documents\K20P64M50SF0.pdf"            title="MK20DX32xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK20DX64xxx5  ****************************** -->
      <device Dname="MK20DX64xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device\Include\MK20D5.h"  define="MK20DX64xxx5"/>
        <debug      svd="SVD\MK20D5.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x10000000"  size="0x8000"     startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P64_50MHZ.FLM"   start="0x00000000"  size="0x10000"                  default="1"/>
        <algorithm  name="Flash\MK_D32_50MHZ.FLM"   start="0x10000000"  size="0x8000"                   default="1"/>
        <book name="Documents\K20P64M50SF0RM.pdf"          title="MK20DX64xxx5 Reference Manual"/>
        <book name="Documents\K20P64M50SF0.pdf"            title="MK20DX64xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK20DX128xxx7  ****************************** -->
      <device Dname="MK20DX128xxx7">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device\Include\MK20D7.h"  define="MK20DX128xxx7"/>
        <debug      svd="SVD\MK20D7.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x10000000"  size="0x8000"     startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P128.FLM"        start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash\MK_D32_72MHZ.FLM"   start="0x10000000"  size="0x8000"                   default="1"/>
        <book name="Documents\K20P100M72SF1RM.pdf"         title="MK20DX128xxx7 Reference Manual"/>
        <book name="Documents\K20P100M72SF1.pdf"           title="MK20DX128xxx7 Data Sheet"/>
      </device>

      <!-- ******************************  MK20DX256xxx7  ****************************** -->
      <device Dname="MK20DX256xxx7">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device\Include\MK20D7.h"  define="MK20DX256xxx7"/>
        <debug      svd="SVD\MK20D7.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x10000000"  size="0x8000"     startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P256.FLM"        start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\MK_D32_72MHZ.FLM"   start="0x10000000"  size="0x8000"                   default="1"/>
        <book name="Documents\K20P100M72SF1RM.pdf"         title="MK20DX256xxx7 Reference Manual"/>
        <book name="Documents\K20P100M72SF1.pdf"           title="MK20DX256xxx7 Data Sheet"/>
      </device>

