t21/Walnut_X/Packages/.cache/Keil.Kinetis_K20_DFP.1.3.0.pdsc
      <!-- ******************************  MK20DX64xxx7  ****************************** -->
      <device Dname="MK20DX64xxx7">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device\Include\MK20D7.h"  define="MK20DX64xxx7"/>
        <debug      svd="SVD\MK20D7.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x10000000"  size="0x8000"     startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P64.FLM"         start="0x00000000"  size="0x10000"                  default="1"/>
        <algorithm  name="Flash\MK_D32_72MHZ.FLM"   start="0x10000000"  size="0x8000"                   default="1"/>
        <book name="Documents\K20P100M72SF1RM.pdf"         title="MK20DX64xxx7 Reference Manual"/>
        <book name="Documents\K20P100M72SF1.pdf"           title="MK20DX64xxx7 Data Sheet"/>
      </device>

      <!-- ******************************  MK20DN512xxx10  ****************************** -->
      <device Dname="MK20DN512xxx10">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
        <compile header="Device\Include\MK20D10.h"  define="MK20DN512xxx10"/>
        <debug      svd="SVD\MK20D10.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P512.FLM"        start="0x00000000"  size="0x80000"                  default="1"/>
        <book name="Documents\K20P81M100SF2RM.pdf"         title="MK20DN512xxx10 Reference Manual"/>
        <book name="Documents\K20P81M100SF2V2.pdf"         title="MK20DN512xxx10 Data Sheet"/>
      </device>

      <!-- ******************************  MK20DX128xxx10  ****************************** -->
      <device Dname="MK20DX128xxx10">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
        <compile header="Device\Include\MK20D10.h"  define="MK20DX128xxx10"/>
        <debug      svd="SVD\MK20D10.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x10000000"  size="0x20000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P128.FLM"        start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash\MK_D128.FLM"        start="0x10000000"  size="0x20000"                  default="1"/>
        <book name="Documents\K20P144M100SF2RM.pdf"        title="MK20DX128xxx10 Reference Manual"/>
        <book name="Documents\K20P144M100SF2V2.pdf"        title="MK20DX128xxx10 Data Sheet"/>
      </device>

      <!-- ******************************  MK20DX256xxx10  ****************************** -->
      <device Dname="MK20DX256xxx10">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
        <compile header="Device\Include\MK20D10.h"  define="MK20DX256xxx10"/>
        <debug      svd="SVD\MK20D10.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x10000000"  size="0x40000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P256.FLM"        start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\MK_D256.FLM"        start="0x10000000"  size="0x40000"                  default="1"/>
        <book name="Documents\K20P81M100SF2RM.pdf"         title="MK20DX256xxx10 Reference Manual"/>
        <book name="Documents\K20P81M100SF2V2.pdf"         title="MK20DX256xxx10 Data Sheet"/>
      </device>

      <!-- ******************************  MK20FN1M0xxx12  ****************************** -->
      <device Dname="MK20FN1M0xxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device\Include\MK20F12.h"  define="MK20FN1M0xxx12"/>
        <debug      svd="SVD\MK20F12.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P1M0.FLM"        start="0x00000000"  size="0x100000"                 default="1"/>
        <book name="Documents\K20P144M120SF3RM.pdf"        title="MK20FN1M0xxx12 Reference Manual"/>
        <book name="Documents\K20P144M120SF3.pdf"          title="MK20FN1M0xxx12 Data Sheet"/>
      </device>

      <!-- ******************************  MK20FX512xxx12  ****************************** -->
      <device Dname="MK20FX512xxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device\Include\MK20F12.h"  define="MK20FX512xxx12"/>
        <debug      svd="SVD\MK20F12.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x10000000"  size="0x80000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P512X.FLM"       start="0x00000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash\MK_D512.FLM"        start="0x10000000"  size="0x80000"                  default="1"/>
        <book name="Documents\K20P144M120SF3RM.pdf"        title="MK20FX512xxx12 Reference Manual"/>
        <book name="Documents\K20P144M120SF3.pdf"          title="MK20FX512xxx12 Data Sheet"/>
      </device>

      <!-- ******************************  MK21DN512xxx5  ****************************** -->
      <device Dname="MK21DN512xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device\Include\MK21D5.h"  define="MK21DN512xxx5"/>
        <debug      svd="SVD\MK21D5.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P512_50MHZ.FLM"  start="0x00000000"  size="0x80000"                  default="1"/>
        <book name="Documents\K21P80M50SF4RM.pdf"          title="MK21DN512xxx5 Reference Manual"/>
        <book name="Documents\K21P80M50SF4.pdf"            title="MK21DN512xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK21DX128xxx5  ****************************** -->
      <device Dname="MK21DX128xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device\Include\MK21D5.h"  define="MK21DX128xxx5"/>
        <debug      svd="SVD\MK21D5.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x10000000"  size="0x10000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P128_50MHZ.FLM"  start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash\MK_D64_50MHZ.FLM"   start="0x10000000"  size="0x10000"                  default="1"/>
        <book name="Documents\K21P80M50SF4RM.pdf"          title="MK21DX128xxx5 Reference Manual"/>
        <book name="Documents\K21P80M50SF4.pdf"            title="MK21DX128xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK21DX256xxx5  ****************************** -->
      <device Dname="MK21DX256xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device\Include\MK21D5.h"  define="MK21DX256xxx5"/>
        <debug      svd="SVD\MK21D5.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x10000000"  size="0x10000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P256_50MHZ.FLM"  start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\MK_D64_50MHZ.FLM"   start="0x10000000"  size="0x10000"                  default="1"/>
        <book name="Documents\K21P80M50SF4RM.pdf"          title="MK21DX256xxx5 Reference Manual"/>
        <book name="Documents\K21P80M50SF4.pdf"            title="MK21DX256xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK21FN1M0xxx10  ****************************** -->
      <device Dname="MK21FN1M0xxx10">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
        <compile header="Device\Include\MK21F10.h"  define="MK21FN1M0xxx10"/>
        <debug      svd="SVD\MK21F10.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P1M0.FLM"        start="0x00000000"  size="0x100000"                 default="1"/>
      </device>

      <!-- ******************************  MK21FX512xxx10  ****************************** -->
      <device Dname="MK21FX512xxx10">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
        <compile header="Device\Include\MK21F10.h"  define="MK21FX512xxx10"/>
        <debug      svd="SVD\MK21F10.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x10000000"  size="0x20000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P512X.FLM"       start="0x00000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash\MKD128_4KB_SECTOR.FLM" start="0x10000000" size="0x20000"                default="1"/>
      </device>

      <!-- ******************************  MK21FN1M0xxx12  ****************************** -->
      <device Dname="MK21FN1M0xxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device\Include\MK21F12.h"  define="MK21FN1M0xxx12"/>
        <debug      svd="SVD\MK21F12.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P1M0.FLM"        start="0x00000000"  size="0x100000"                 default="1"/>

