t21/Walnut_X/Packages/.cache/Keil.Kinetis_K20_DFP.1.3.0.pdsc
        <book name="Documents\K21P144M120SF5RM.pdf" title="MK21FN1M0xxx12 Reference Manual"/>
        <book name="Documents\K21P144M120SF5.pdf"  title="MK21FN1M0xxx12 Data Sheet"/>
      </device>

      <!-- ******************************  MK21FX512xxx12  ****************************** -->
      <device Dname="MK21FX512xxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device\Include\MK21F12.h"  define="MK21FX512xxx12"/>
        <debug      svd="SVD\MK21F12.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x10000000"  size="0x20000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P512X.FLM"       start="0x00000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash\MKD128_4KB_SECTOR.FLM" start="0x10000000" size="0x20000"                default="1"/>

        <book name="Documents\K21P144M120SF5RM.pdf" title="MK21FX512xxx12 Reference Manual"/>
        <book name="Documents\K21P144M120SF5.pdf"   title="MK21FX512xxx12 Data Sheet"/>
      </device>

      <!-- ******************************  MK22DN512xxx5  ****************************** -->
      <device Dname="MK22DN512xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device\Include\MK22D5.h"  define="MK22DN512xxx5"/>
        <debug      svd="SVD\MK22D5.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P512_50MHZ.FLM"  start="0x00000000"  size="0x80000"                  default="1"/>
        <book name="Documents\K22P121M50SF4RM.pdf"         title="MK22DN512xxx5 Reference Manual"/>
        <book name="Documents\K22P121M50SF4.pdf"           title="MK22DN512xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK22DX128xxx5  ****************************** -->
      <device Dname="MK22DX128xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device\Include\MK22D5.h"  define="MK22DX128xxx5"/>
        <debug      svd="SVD\MK22D5.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x10000000"  size="0x10000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P128_50MHZ.FLM"  start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash\MK_D64_50MHZ.FLM"   start="0x10000000"  size="0x10000"                  default="1"/>
        <book name="Documents\K22P121M50SF4RM.pdf"         title="MK22DX128xxx5 Reference Manual"/>
        <book name="Documents\K22P121M50SF4.pdf"           title="MK22DX128xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK22DX256xxx5  ****************************** -->
      <device Dname="MK22DX256xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device\Include\MK22D5.h"  define="MK22DX256xxx5"/>
        <debug      svd="SVD\MK22D5.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x10000000"  size="0x10000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P256_50MHZ.FLM"  start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\MK_D64_50MHZ.FLM"   start="0x10000000"  size="0x10000"                  default="1"/>
        <book name="Documents\K22P121M50SF4RM.pdf"         title="MK22DX256xxx5 Reference Manual"/>
        <book name="Documents\K22P121M50SF4.pdf"           title="MK22DX256xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK22FN128xxx10  ****************************** -->
      <device Dname="MK22FN128xxx10">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
        <compile header="Device\Include\MK22F12810.h"  define="MK22FN128xxx10"/>
        <debug      svd="SVD\MK22F12810.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P128.FLM"        start="0x00000000"  size="0x20000"                  default="1"/>
      </device>

      <!-- ******************************  MK22FN1M0xxx10  ****************************** -->
      <device Dname="MK22FN1M0xxx10">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
        <compile header="Device\Include\MK22F10.h"  define="MK22FN1M0xxx10"/>
        <debug      svd="SVD\MK22F10.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P1M0.FLM"        start="0x00000000"  size="0x100000"                 default="1"/>
      </device>

      <!-- ******************************  MK22FN256xxx12  ****************************** -->
      <device Dname="MK22FN256xxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device\Include\MK22F25612.h"  define="MK22FN256xxx12"/>
        <debug      svd="SVD\MK22F25612.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P256.FLM"        start="0x00000000"  size="0x40000"                  default="1"/>
      </device>

      <!-- ******************************  MK22FN512xxx12  ****************************** -->
      <device Dname="MK22FN512xxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device\Include\MK22F51212.h"  define="MK22FN512xxx12"/>
        <debug      svd="SVD\MK22F51212.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P512.FLM"        start="0x00000000"  size="0x80000"                  default="1"/>
      </device>

      <!-- ******************************  MK22FX512xxx10  ****************************** -->
      <device Dname="MK22FX512xxx10">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
        <compile header="Device\Include\MK22F10.h"  define="MK22FX512xxx10"/>
        <debug      svd="SVD\MK22F10.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x10000000"  size="0x20000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P512X.FLM"       start="0x00000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash\MKD128_4KB_SECTOR.FLM" start="0x10000000" size="0x20000"                default="1"/>
      </device>

      <!-- ******************************  MK22FX512xxx12  ****************************** -->
      <device Dname="MK22FX512xxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device\Include\MK22F12.h"  define="MK22FX512xxx12"/>
        <debug      svd="SVD\MK22F12.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x10000000"  size="0x20000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P512X.FLM"       start="0x00000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash\MKD128_4KB_SECTOR.FLM" start="0x10000000" size="0x20000"                default="1"/>

        <book name="Documents\K22P144M120SF5RM.pdf"        title="MK22FX512xxx12 Reference Manual"/>
        <book name="Documents\K22P144M120SF5.pdf"          title="MK22FX512xxx12 Data Sheet"/>
      </device>

      <!-- ******************************  MK22FN1M0xxx12  ****************************** -->
      <device Dname="MK22FN1M0xxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device\Include\MK22F12.h"  define="MK22FN1M0xxx12"/>
        <debug      svd="SVD\MK22F12.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P1M0.FLM"        start="0x00000000"  size="0x100000"                 default="1"/>

        <book name="Documents\K22P144M120SF5RM.pdf"        title="MK22FN1M0xxx12 Reference Manual"/>
        <book name="Documents\K22P144M120SF5.pdf"          title="MK22FN1M0xxx12 Data Sheet"/>
      </device>

      <!-- ******************************  MK24FN1M0xxx12  ****************************** -->
      <device Dname="MK24FN1M0xxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device\Include\MK24F12.h"  define="MK24FN1M0xxx12"/>
        <debug      svd="SVD\MK24F12.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P1M0.FLM"        start="0x00000000"  size="0x100000"                 default="1"/>
      </device>

      <!-- ******************************  MK24FN256xxx12  ****************************** -->
      <device Dname="MK24FN256xxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device\Include\MK24F25612.h"  define="MK24FN256xxx12"/>
        <debug      svd="SVD\MK24F25612.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x30000"     init   ="0"  default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"     init   ="0"  default="0"/>
        <algorithm  name="Flash\MKP256_4KB_SECTOR.FLM"        start="0x00000000"  size="0x40000"                  default="1"/>
      </device>

<!-- MK21DA5 Devices -->
      <!-- ******************************  MK21DX128Axxx5  ***************************** -->
      <device Dname="MK21DX128Axxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device\Include\MK21DA5.h"  define="MK21DX128Axxx5"/>
        <debug      svd="SVD\MK21DA5.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x10000000"  size="0x10000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P128.FLM"        start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash\MK_D64.FLM"         start="0x10000000"  size="0x10000"                  default="1"/>
        <book name="Documents\K21P121M50SF4V2RM.pdf"          title="MK21DX128Axxx5 Reference Manual"/>
        <book name="Documents\K21P121M50SF4V2.pdf"            title="MK21DX128Axxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK21DX256Axxx5  ***************************** -->
      <device Dname="MK21DX256Axxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device\Include\MK21DA5.h"  define="MK21DX256Axxx5"/>
        <debug      svd="SVD\MK21DA5.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x10000000"  size="0x10000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P256.FLM"        start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\MK_D64.FLM"         start="0x10000000"  size="0x10000"                  default="1"/>
        <book name="Documents\K21P121M50SF4V2RM.pdf"          title="MK21DX256Axxx5 Reference Manual"/>
        <book name="Documents\K21P121M50SF4V2.pdf"            title="MK21DX256Axxx5 Data Sheet"/>
      </device>

