t21/Walnut_X/Packages/.cache/Keil.Kinetis_K20_DFP.1.3.0.pdsc
    <condition id="K20 50MHz">
      <description>Freescale Kinetis K20 device series</description>
      <require Dvendor="Freescale:78" Dname="MK20DX128xxx5"/>
    </condition>

    <condition id="MK20D5">
      <description>Freescale Kinetis K20D5  Device</description>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK20DN128xxx5"/>
      <accept  Dname="MK20DN32xxx5"/>
      <accept  Dname="MK20DN64xxx5"/>
      <accept  Dname="MK20DX128xxx5"/>
      <accept  Dname="MK20DX32xxx5"/>
      <accept  Dname="MK20DX64xxx5"/>
    </condition>

    <condition id="MK20D10">
      <description>Freescale Kinetis K20D10  Device</description>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK20DN512xxx10"/>
      <accept  Dname="MK20DX128xxx10"/>
      <accept  Dname="MK20DX256xxx10"/>
    </condition>

    <condition id="MK20D7">
      <description>Freescale Kinetis K20D7  Device</description>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK20DX128xxx7"/>
      <accept  Dname="MK20DX256xxx7"/>
      <accept  Dname="MK20DX64xxx7"/>
    </condition>

    <condition id="MK20F12">
      <description>Freescale Kinetis K20  Device</description>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK20FN1M0xxx12"/>
      <accept  Dname="MK20FX512xxx12"/>
    </condition>

    <condition id="MK21D5">
      <description>Freescale Kinetis K21D5  Device</description>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK21DN512xxx5"/>
      <accept  Dname="MK21DX128xxx5"/>
      <accept  Dname="MK21DX256xxx5"/>
    </condition>

    <condition id="MK21F10">
      <description>Freescale Kinetis K21F10  Device</description>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK21FN1M0xxx10"/>
      <accept  Dname="MK21FX512xxx10"/>
    </condition>

    <condition id="MK22D5">
      <description>Freescale Kinetis K22D5  Device</description>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK22DN512xxx5"/>
      <accept  Dname="MK22DX128xxx5"/>
      <accept  Dname="MK22DX256xxx5"/>
    </condition>

    <condition id="MK22F10">
      <description>Freescale Kinetis K22F10  Device</description>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK22FN1M0xxx10"/>
      <accept  Dname="MK22FX512xxx10"/>
    </condition>

    <condition id="MK24F12">
      <description>Freescale Kinetis K24F12  Device</description>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK24FN1M0xxx12"/>
    </condition>

    <condition id="MK22F12810">
      <description>Freescale Kinetis MK22FN128xxx10  Device</description>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK22FN128xxx10"/>
    </condition>

    <condition id="MK22F25612">
      <description>Freescale Kinetis MK22FN256xxx12  Device</description>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK22FN256xxx12"/>
    </condition>

    <condition id="MK22F51212">
      <description>Freescale Kinetis MK22FN512xxx12  Device</description>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK22FN512xxx12"/>
    </condition>

    <condition id="MK24F25612">
      <description>Freescale Kinetis MK24FN256xxx12  Device</description>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK24FN256xxx12"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="MK21F12">
      <description>Freescale Kinetis K21F12 devices</description>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK21FN1M0xxx12"/>
      <accept  Dname="MK21FX512xxx12"/>
    </condition>

    <condition id="MK21FA12">
      <description>Freescale Kinetis MK21FA12 devices</description>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK21FX512Axxx12"/>
      <accept  Dname="MK21FN1M0Axxx12"/>
    </condition>

    <condition id="MK22F12">
      <description>Freescale Kinetis K22F12  Device</description>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK22FN1M0xxx12"/>
      <accept  Dname="MK22FX512xxx12"/>
    </condition>

    <condition id="MK22FA12">
      <description>Freescale Kinetis K22FA12 device</description>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK22FN1M0Axxx12"/>
      <accept  Dname="MK22FX512Axxx12"/>
    </condition>

    <condition id="K21DA5">
      <description>Freescale Kinetis K21DA 50MHz devices</description>
      <!--require Dvendor="Freescale:78" Dname="MK21D????Axxx5"/-->
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK21DX128Axxx5"/>
      <accept  Dname="MK21DX256Axxx5"/>
      <accept  Dname="MK21DN512Axxx5"/>
    </condition>


    <!-- Device + CMSIS Conditions -->
    <condition id="MK21F12 CMSIS">
      <description>Freescale Kinetis K21F12 devices and CMSIS-CORE</description>
      <require condition="MK21F12"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK22F12 CMSIS">
      <description>Freescale Kinetis K22F12 devices and CMSIS-CORE</description>
      <require condition="MK22F12"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK22FA12 CMSIS">
      <description>Freescale Kinetis K22FA12 devices and CMSIS-CORE</description>
      <require condition="MK22FA12"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="K21DA5 CMSIS">
      <description>Freescale Kinetis K21DA 50MHz devices and CMSIS-CORE</description>
      <require condition="K21DA5"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK21FA12 CMSIS">
      <description>Freescale Kinetis MK21FA12 120MHz devices and CMSIS-CORE</description>
      <require condition="MK21FA12"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK20D5 GPIO DMA">
      <description>Freescale Kinetis K20D5 Series with GPIO and DMA Driver</description>
      <require condition="MK20D5"/>
      <require Cclass ="Device" Cgroup="GPIO" />
      <require Cclass ="Device" Cgroup="DMA" />
    </condition>

    <condition id="MK20D5 CMSIS RTOS">
      <description>Freescale Kinetis K20D5 Series with CMSIS and RTOS</description>
      <require condition="MK20D5"/>
      <require Cclass ="CMSIS" Cgroup="CORE"/>
      <require Cclass ="CMSIS" Cgroup="RTOS"/>
    </condition>

    <condition id="MK26F18 CMSIS">
      <description>Freescale Kinetis K26F 180MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK26FN2M0xxx18"/>
    </condition>
