t21/Walnut_X/Packages/.cache/Keil.Kinetis_K20_DFP.1.3.0.pdsc
  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.0.1" condition="K20 CMSIS Device">  <!-- Cversion is necessary -->
      <description>System Startup for Kinetis K20 device series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_MK20xx    /* Device Startup for K20 device Series */
      </RTE_Components_h>
      <files>
        <!--  include folder -->
        <file category="include" name="Device\Include\"/>

        <!-- startup files -->
        <file category="source" name="Device\Source\ARM\startup_MK20D5.s"    	        attr="config"  condition="MK20D5"/>
        <file category="source" name="Device\Source\ARM\startup_MK20D10.s"    	      attr="config"  condition="MK20D10"/>
        <file category="source" name="Device\Source\ARM\startup_MK20D7.s"    	        attr="config"  condition="MK20D7"/>
        <file category="source" name="Device\Source\ARM\startup_MK20F12.s"    	      attr="config"  condition="MK20F12"/>
        <file category="source" name="Device\Source\ARM\startup_MK21D5.s"    	        attr="config"  condition="MK21D5"/>
        <file category="source" name="Device\Source\ARM\startup_MK21F10.s"    	      attr="config"  condition="MK21F10"/>
        <file category="source" name="Device\Source\ARM\startup_MK22D5.s"    	        attr="config"  condition="MK22D5"/>
        <file category="source" name="Device\Source\ARM\startup_MK22F10.s"    	      attr="config"  condition="MK22F10"/>
        <file category="source" name="Device\Source\ARM\startup_MK24F12.s"    	      attr="config"  condition="MK24F12"/>
        <file category="source" name="Device\Source\ARM\startup_MK22F12810.s"  	      attr="config"  condition="MK22F12810"/>
        <file category="source" name="Device\Source\ARM\startup_MK22F25612.s"  	      attr="config"  condition="MK22F25612"/>
        <file category="source" name="Device\Source\ARM\startup_MK24F25612.s"  	      attr="config"  condition="MK24F25612"/>
        <file category="source" name="Device\Source\ARM\startup_MK22F51212.s"  	      attr="config"  condition="MK22F51212"/>
        <!-- system file -->
        <file category="source" name="Device\Source\system_MK20D5.c"    	            attr="config"  condition="MK20D5"/>
        <file category="source" name="Device\Source\system_MK20D10.c"    	            attr="config"  condition="MK20D10"/>
        <file category="source" name="Device\Source\system_MK20D7.c"    	            attr="config"  condition="MK20D7"/>
        <file category="source" name="Device\Source\system_MK20F12.c"    	            attr="config"  condition="MK20F12"/>
        <file category="source" name="Device\Source\system_MK21D5.c"    	            attr="config"  condition="MK21D5"/>
        <file category="source" name="Device\Source\system_MK21F10.c"    	            attr="config"  condition="MK21F10"/>
        <file category="source" name="Device\Source\system_MK22D5.c"    	            attr="config"  condition="MK22D5"/>
        <file category="source" name="Device\Source\system_MK22F10.c"    	            attr="config"  condition="MK22F10"/>
        <file category="source" name="Device\Source\system_MK24F12.c"    	            attr="config"  condition="MK24F12"/>
        <file category="source" name="Device\Source\system_MK22F12810.c"  	          attr="config"  condition="MK22F12810"/>
        <file category="source" name="Device\Source\system_MK22F25612.c"  	          attr="config"  condition="MK22F25612"/>
        <file category="source" name="Device\Source\system_MK24F25612.c"  	          attr="config"  condition="MK24F25612"/>
        <file category="source" name="Device\Source\system_MK22F51212.c"  	          attr="config"  condition="MK22F51212"/>

        <!-- system header file -->
        <file category="source" name="Device\Source\system_MK22F12810.h"              attr="config" version="1.0.0" condition="MK22F12810"/>
        <file category="source" name="Device\Source\system_MK22F25612.h"              attr="config" version="1.0.0" condition="MK22F25612"/>
        <file category="source" name="Device\Source\system_MK24F25612.h"              attr="config" version="1.0.0" condition="MK24F25612"/>

        <!-- device configuration required by drivers at the moment -->
        <file category="header" name="RTE_Driver\Config\RTE_Device.h" attr="config"/>
      </files>
    </component>

    <!-- Startup MK21F12 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.9.0" condition="MK21F12 CMSIS">
      <description>System Startup for Freescale Kinetis MK21F12 devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device\Include\MK21F12.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_MK21F12.s"  attr="config" version="1.9.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_MK21F12.c"       attr="config" version="1.9.0"/>
        <file category="header" name="Device\Source\system_MK21F12.h"       attr="config" version="1.9.0"/>
      </files>
    </component>

    <!-- Startup MK21FA12 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK21FA12 CMSIS">
      <description>System Startup for Freescale Kinetis MK21FA12 120MHz devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device\Include\MK21FA12.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_MK21FA12.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_MK21FA12.c"       attr="config" version="1.0.0"/>
        <file category="header" name="Device\Source\system_MK21FA12.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MK22F12 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.9.0" condition="MK22F12 CMSIS">
      <description>System Startup for Freescale Kinetis MK22F12 devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device\Include\MK22F12.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_MK22F12.s"  attr="config" version="1.9.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_MK22F12.c"       attr="config" version="1.9.0"/>
        <file category="header" name="Device\Source\system_MK22F12.h"       attr="config" version="1.9.0"/>
      </files>
    </component>

    <!-- Startup MK22FA12 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.9.0" condition="MK22FA12 CMSIS">
      <description>System Startup for Freescale Kinetis MK22FA12 devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device\Include\MK22FA12.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_MK22FA12.s"  attr="config" version="1.9.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_MK22FA12.c"       attr="config" version="1.9.0"/>
        <file category="header" name="Device\Source\system_MK22FA12.h"       attr="config" version="1.9.0"/>
      </files>
    </component>

