t21/Walnut_X/Packages/.cache/Keil.Kinetis_K20_DFP.1.3.0.pdsc
    <!-- Startup MK21DA5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="K21DA5 CMSIS">
      <description>System Startup for Freescale Kinetis K21DA 50MHz devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device\Include\MK21DA5.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_MK21DA5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_MK21DA5.c"       attr="config" version="1.0.0"/>
        <file category="header" name="Device\Source\system_MK21DA5.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MK26F18 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="MK26F18 CMSIS">
      <description>System Startup for Freescale MK26F18 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_MK26F18.s" attr="config" version="2.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MK26F18.c"      attr="config" version="2.0.0"/>
        <file category="header"  name="Device\Source\system_MK26F18.h"      attr="config" version="2.0.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="GPIO" Cversion="1.0.0" condition="MK20D5">
      <description>GPIO driver used by RTE Drivers for Kinetis K20 Series</description>
      <files>
        <file category="header" name="RTE_Driver\GPIO_K20.h"/>
        <file category="source" name="RTE_Driver\GPIO_K20.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="DMA" Cversion="1.0.0" condition="MK20D5">
      <description>DMA driver used by RTE Drivers for Kinetis K20 Series</description>
      <files>
        <file category="header" name="RTE_Driver\DMA_K20.h"/>
        <file category="source" name="RTE_Driver\DMA_K20.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="UART" Cversion="1.0.0" condition="MK20D5 GPIO DMA">
      <description>UART Driver for Kinetis K20 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_UART0               /* Driver UART0 */
        #define RTE_Drivers_UART1               /* Driver UART1 */
        #define RTE_Drivers_UART2               /* Driver UART2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\UART_K20.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="USB Device" Cversion="1.01.0" condition="MK20D5 CMSIS RTOS">
      <description>USB Device Driver for Kinetis K20 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\USBD_K20.c"/>
      </files>
    </component>

    <!-- TWR-K20D50M Development Board -->
    <component Cclass="Board Support" Cgroup="TWR-K20D50M" Csub="LED" Cversion="0.0.1" condition="K20 50MHz">
      <description>LED driver for Freescale TWR-K20D50M Development Board</description>
      <files>
        <file category="header" name="Boards\Freescale\TWR-K20D50M\Common\LED.h"/>
        <file category="source" name="Boards\Freescale\TWR-K20D50M\Common\LED.c"/>
      </files>
    </component>

  </components>

  <boards>
    <board name="TWR-K24F120M" vendor="Freescale" revision="Rev. A" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The TWR-K24F120M is a development tool for the 120 MHz K20 families of Kinetis microcontrollers.</description>
      <mountedDevice     deviceIndex="0" Dvendor="Freescale:78" Dname="MK24FN256xxx12"/>
      <compatibleDevice  deviceIndex="0" Dvendor="Freescale:78" Dfamily="K20 Series"/>
      <feature type="ODbg"      n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Batt"      n="1"              name="Battery holder for 20mm lithium battery (e.g. 2032, 2025)"/>
      <feature type="USB"       n="1"              name="USB Micro-AB Connector"/>
      <feature type="ConnOther" n="1"              name="Touch Tower Plug-in Socket"/>
      <feature type="ConnOther" n="1"              name="General purpose Tower Plug-in (TWRPI) socket"/>
      <feature type="ConnOther" n="2"              name="Tower connectivity for access to USB, Ethernet, RS232/RS485, CAN, SPI, I2C, Flexbus, etc."/>
      <feature type="Poti"      n="1"/>
      <feature type="Button"    n="3"/>
      <feature type="Accelerometer" n="1"          name="Three axis accelerometer (MMA8451Q)"/>
      <feature type="LED"       n="4"              name="Four user-controlled status LEDs"/>
      <feature type="TowerFF"   n="1"/>
    </board>

    <board name="TWR-K20D50M" vendor="Freescale" revision="Rev. A" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The TWR-K20D50M is a development tool for the 50 MHz K20 families of Kinetis microcontrollers.</description>
      <mountedDevice     deviceIndex="0" Dvendor="Freescale:78" Dname="MK20DX128xxx5"/>
      <compatibleDevice  deviceIndex="0" Dvendor="Freescale:78" Dfamily="K20 Series"/>
    </board>

    <board name="TWR-K20D72M" vendor="Freescale" revision="Rev. A" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The TWR-K20D72M is a development tool for the 72 MHz K20 families of Kinetis microcontrollers.</description>
      <mountedDevice     deviceIndex="0" Dvendor="Freescale:78" Dname="MK20DX256xxx7"/>
      <compatibleDevice  deviceIndex="0" Dvendor="Freescale:78" Dfamily="K20 Series"/>
    </board>

    <board name="TWR-K22F120M" vendor="Freescale" revision="Rev. A" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The TWR-K22F120M is a development tool for the 120 MHz K20 families of Kinetis microcontrollers.</description>
      <mountedDevice     deviceIndex="0" Dvendor="Freescale:78" Dname="MK22FN512xxx12"/>
      <compatibleDevice  deviceIndex="0" Dvendor="Freescale:78" Dfamily="K20 Series"/>
    </board>

    <board name="FRDM-K20D50M" vendor="Freescale" revision="Rev. A" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The FRDM-K20D50M is a development tool for the 50 MHz K20 families of Kinetis microcontrollers.</description>
      <mountedDevice     deviceIndex="0" Dvendor="Freescale:78" Dname="MK20DX128xxx5"/>
      <compatibleDevice  deviceIndex="0" Dvendor="Freescale:78" Dfamily="K20 Series"/>
    </board>

  </boards>

  <examples>
    <!-- TWR-K20D50M Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards\Freescale\TWR-K20D50M\Blinky">
      <description>Blinky example</description>
      <board name="TWR-K20D50M" vendor="Freescale" Dvendor="Freescale:78" Dname="MK20DX128xxx5"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Freescale\TWR-K20D50M\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-K20D50M" vendor="Freescale" Dvendor="Freescale:78" Dname="MK20DX128xxx5"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Freescale\FRDM-K20D50M\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="FRDM-K20D50M" vendor="Freescale" Dvendor="Freescale:78" Dname="MK20DX128xxx5"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Freescale\TWR-K20D72M\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-K20D72M" vendor="Freescale" Dvendor="Freescale:78" Dname="MK20DX256xxx7"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- TWR-K22F120M Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards\Freescale\TWR-K22F120M\Blinky">
      <description>Blinky example</description>
      <board name="TWR-K22F120M" vendor="Freescale" Dvendor="Freescale:78" Dname="MK22FN512xxx12"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Freescale\TWR-K22F120M\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-K22F120M" vendor="Freescale" Dvendor="Freescale:78" Dname="MK22FN512xxx12"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- TWR-K24F120M Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards\Freescale\TWR-K24F120M\Blinky">
      <description>Blinky example</description>
      <board name="TWR-K24F120M" vendor="Freescale" Dvendor="Freescale:78" Dname="MK24FN256xxx12"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Freescale\TWR-K24F120M\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-K24F120M" vendor="Freescale" Dvendor="Freescale:78" Dname="MK24FN256xxx12"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
